app/views/posts/show.html.erb

<h2>Все комментарии</h2>
<% @post.commets.each do |commet| %>
---
SELECT "commets".* FROM "commets" WHERE "commets"."post_id" = ?  [["post_id", 1]]