app/controllers/commets_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "commets" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "bob"], ["body", "bob comments"], ["post_id", 1], ["created_at", "2019-05-29 17:25:09.117868"], ["updated_at", "2019-05-29 17:25:09.117868"]]
---
  def create
    @post = Post.find(params[:post_id])
    @commet = @post.commets.create(commet_params)